update README and screenshots
